feat: automate changelog
